1. SQL Challenge
*Scenario:* You have a sales database with two tables: Orders (OrderID, CustomerID, OrderDate, Amount) and Customers (CustomerID, Name, City). Write SQL queries to:
- Find the total sales amount for each customer.
- List customers who have not placed any orders.
- Identify the city with the highest number of orders.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sqlalchemy import create_engine, text
engine = create_engine('xxxxxcredentialsxxxxx')
conn = engine.connect()

In [2]:
customers = pd.read_sql_query(text('SELECT * FROM db_customers_kaggle'), conn)
customers.head()

   customerid                        name       city    country
0         103           Atelier graphique     Nantes     France
1         112          Signal Gift Stores  Las Vegas        USA
2         114  Australian Collectors, Co.  Melbourne  Australia
3         119           La Rochelle Gifts     Nantes     France
4         121          Baane Mini Imports    Stavern     Norway

In [3]:
orders = pd.read_sql_query(text('SELECT * FROM db_orders_kaggle'), conn)
orders.head()

   orderid  customerid   orderdate  amount
0    10100         363  2003-01-06   10224
1    10101         128  2003-01-09   10549
2    10102         181  2003-01-10    5495
3    10103         121  2003-01-29   50219
4    10104         141  2003-01-31   40206

In [4]:
total_sales_each_customers = pd.read_sql_query(text('select db_customers_kaggle.name, \
                                sum(db_orders_kaggle.amount) total_Sales \
                                from db_customers_kaggle \
                                inner join db_orders_kaggle on db_customers_kaggle.customerid = db_orders_kaggle.customerid\
                                group by 1\
                                order by 2 desc'), conn)
total_sales_each_customers

                            name  total_sales
0         Euro+ Shopping Channel       820690
1   Mini Gifts Distributors Ltd.       591829
2     Australian Collectors, Co.       180586
3             Muscle Machine Inc       177914
4              La Rochelle Gifts       158573
..                           ...          ...
93                  Royale Belge        29218
94            Frau da Collezione        25358
95             Atelier graphique        22314
96       Auto-Moto Classics Inc.        21555
97             Boards & Toys Co.         7919

[98 rows x 2 columns]

In [5]:
customers_not_placed_any_orders = pd.read_sql_query(text('select db_customers_kaggle.name from db_customers_kaggle\
                                     left join db_orders_kaggle on db_customers_kaggle.customerid = db_orders_kaggle.customerid\
                                     where db_orders_kaggle.customerid is null\
                                     order by 1'), conn)
customers_not_placed_any_orders

                              name
0                    ANG Resellers
1           American Souvenirs Inc
2              Anton Designs, Ltd.
3       Asian Shopping Network, Co
4            Asian Treasures, Inc.
5                BG&E Collectables
6        Cramer Spezialit�ten, Ltd
7                 Der Hund Imports
8         Feuer Online Stores, Inc
9                Franken Gifts, Co
10              Havel & Zbyszek Co
11                 Kommission Auto
12       Kremlin Collectables, Co.
13          Lisboa Souveniers, Inc
14        Messner Shopping Network
15             Mit Vergn�gen & Co.
16                 Nat�rlich Autos
17               Porto Imports Co.
18           Precious Collectables
19              Raanan Stores, Inc
20            SAR Distributors, Co
21                Schuyler Imports
22  Stuttgart Collectable Exchange
23                Warburg Exchange

In [6]:
city_highest_number_of_order = pd.read_sql_query(text('select db_customers_kaggle.city,\
                                     count (distinct db_orders_kaggle.orderid) number_of_orders\
                                     from db_customers_kaggle\
                                     inner join db_orders_kaggle on db_customers_kaggle.customerid = db_orders_kaggle.customerid\
                                     group by 1\
                                     order by 2 desc\
                                     limit 5 '), conn)
city_highest_number_of_order

         city  number_of_orders
0      Madrid                31
1  San Rafael                17
2         NYC                16
3  Auckland                   9
4       Paris                 9

2. Data Modeling Exercise
*Scenario:* Design a data model for an e-commerce platform that includes entities for users, products, orders, and reviews. Ensure that your model supports querying the top-rated products in each category and tracks the order history of users.

In [7]:
df = pd.read_excel('Flat.table.xlsx')

In [8]:
df.dropna(inplace=True)
df.head()

,id.product,product.name,order.id,order.date,revenue,reviews.date,reviews.id,reviews.rating,users.city,users.province,users.id,users
0,P1,Electronic accessories,1004,2017-01-10,10224,2017-01-13,R-5,5,Bolaang Mongondow Regency,"North Sulawesi, Indonesia",C312,Adapter
1,P2,Fashion accessories,1004,2017-01-10,10549,2017-01-13,R-5,5,Sigi Regency,"Central Sulawesi, Indonesia",C19650,truman
2,P3,Food and beverages,1004,2017-01-10,5495,2017-01-13,R-5,5,South Konawe Regency,"Southeast Sulawesi, Indonesia",C4529,DaveZ
3,P4,Health and beauty,1004,2017-01-10,50219,2017-01-13,R-4,4,Simalungun Regency,"North Sumatra, Indonesia",C17182,Shacks
4,P5,Home and lifestyle,1004,2017-01-09,40206,2017-01-12,R-5,5,Manado City,"North Sulawesi, Indonesia",C6039,explore42

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13148 entries, 0 to 13147
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id.product      13148 non-null  object
 1   product.name    13148 non-null  object
 2   order.id        13148 non-null  int64
 3   order.date      13148 non-null  datetime64[ns]
 4   revenue         13148 non-null  int64
 5   reviews.date    13148 non-null  datetime64[ns]
 6   reviews.id      13148 non-null  object
 7   reviews.rating  13148 non-null  int64
 8   users.city      13148 non-null  object
 9   users.province  13148 non-null  object
 10  users.id        13148 non-null  object
 11  users           13148 non-null  object
dtypes: datetime64[ns](2), int64(3), object(7)
memory usage: 1.2+ MB

1. Identifya Fact table (orders)
2. Determine Dimension table (users,products,and reviews)

In [10]:
orders_fact = df[["order.id","order.date","id.product","revenue","reviews.id","reviews.date","users.id"]]
orders_fact

,order.id,order.date,id.product,revenue,reviews.id,reviews.date,users.id
0,1004,2017-01-10,P1,10224,R-5,2017-01-13,C312
1,1004,2017-01-10,P2,10549,R-5,2017-01-13,C19650
2,1004,2017-01-10,P3,5495,R-5,2017-01-13,C4529
3,1004,2017-01-10,P4,50219,R-4,2017-01-13,C17182
4,1004,2017-01-09,P5,40206,R-5,2017-01-12,C6039
...,...,...,...,...,...,...,...
13143,1024,2017-02-11,P4,51619,R-5,2017-02-14,C8963
13144,1024,2017-02-11,P5,20314,R-5,2017-02-14,C617
13145,1024,2017-02-11,P6,35035,R-5,2017-02-14,C2680
13146,1024,2017-02-11,P1,6420,R-5,2017-02-14,C16460
13147,1024,2017-02-11,P2,35807,R-1,2017-02-14,C5335

In [11]:
products_dim = df[["id.product","product.name"]].drop_duplicates().sort_values(by=['id.product'], ascending=True)
products_dim

  id.product            product.name
0         P1  Electronic accessories
1         P2     Fashion accessories
2         P3      Food and beverages
3         P4       Health and beauty
4         P5      Home and lifestyle
5         P6       Sports and travel

In [12]:
users_dim = df[["users.id","users","users.city","users.province"]].drop_duplicates().sort_values(by=['users.id'], ascending=True).reset_index(drop=True)
users_dim

,users.id,users,users.city,users.province
0,C1,April,Bau-Bau City,"Southeast Sulawesi, Indonesia"
1,C10000,KDS4,Muaro Jambi Regency,"Jambi, Indonesia"
2,C10001,kealmoon,Mukomuko Regency,"Bengkulu, Indonesia"
3,C10004,Kedar,West Muna Regency,"Southeast Sulawesi, Indonesia"
4,C10005,Kedmsd,Murung Raya Regency,"Central Kalimantan, Indonesia"
...,...,...,...,...
10342,C9991,Kdawg,North Minahasa Regency,"North Sulawesi, Indonesia"
10343,C9993,Kdee,Mojokerto Regency,"East Java, Indonesia"
10344,C9994,Kden,Morowali Regency,"Central Sulawesi, Indonesia"
10345,C9996,kdla,North Morowali Regency,"Central Sulawesi, Indonesia"
10346,C9999,Kdob199,Muaro Jambi Regency,"Jambi, Indonesia"

In [13]:
reviews_dim = df[["reviews.id","reviews.rating"]].drop_duplicates().sort_values(by=['reviews.id'], ascending=True).reset_index(drop=True)
reviews_dim

  reviews.id  reviews.rating
0        R-1               1
1        R-2               2
2        R-3               3
3        R-4               4
4        R-5               5

Data modeling

In [14]:
from IPython.display import Image  
Image(url="data-modeling.png", width=500, height=250)

3. ETL Process Task
*Scenario:* You are provided with a CSV file containing sales data (SaleID, SaleDate, ProductID, QuantitySold, UnitPrice) and a JSON file listing product details (ProductID, Name, Category). Write a script to extract data from these files, calculate the total sales amount for each product, and load the results into a new CSV file.

Sales data (csv file)

In [15]:
def total_sales_each_product():
    import json
    input1 = 'Sales.data.csv'
    input2 = 'Product.category.json'
    sales_data = pd.read_csv(input1,delimiter=';')
    sales_data["sales.date"] = pd.to_datetime(sales_data["sales.date"])
    sales_data["total_amount"] = sales_data["quantity.sold"]*sales_data["unit.prices"]
    with open('Product.category.json') as f:
        d = json.load(f)
        product_category = pd.read_json(d)
    total_sales_groupby_product = sales_data.groupby("product.id", as_index=False).sum()
    total_sales_each_product = pd.merge(product_category,total_sales_groupby_product, on='product.id', how='left')[["name","total_amount"]].sort_values(by=['total_amount'], ascending=False)
    total_sales_each_product = total_sales_each_product.reset_index(drop=True)
    
    return total_sales_each_product.to_csv("total_sales_each_product.csv"),total_sales_each_product
    
    
total_sales_each_product()

(None,
                                                name  total_amount
 0                    Sharp AL-1530CS Digital Copier       1633893
 1                                             2160i        956265
 2         Hoover WindTunnelâ„¢ Plus Canister Vacuum        909846
 3                Canon PC1060 Personal Laser Copier        902781
 4                     Canon Image Class D660 Copier        883728
 ..                                              ...           ...
 440                                        Avery 49            75
 441                                       Avery 498            75
 442     10- 4 1/8" x 9 1/2" Security-Tint Envelopes            62
 443  Personal Creationsâ„¢ Ink Jet Cards and Labels            58
 444                      Heavy-Duty E-Z-DÂ® Binders            50

 [445 rows x 2 columns])

4. Scripting and Automation
*Scenario:* Write a Python script that takes a URL of a webpage as input, scrapes the webpage for all hyperlinks, and outputs a list of unique URLs found on the page.

In [16]:
import pandas as pd
import requests
from bs4 import BeautifulSoup


def get_links(url):
    reqs = requests.get(url)
    soup = BeautifulSoup(reqs.text, 'html.parser')

    urls = []
    for link in soup.find_all('a'):
        print(link.get('href'))

get_links('https://www.cnnindonesia.com/nasional')

https://connect.detik.com/oauth/authorize?clientId=10027&redirectUrl=https%3A%2F%2Fwww.cnnindonesia.com%2Fauthorize%3Fu%3Dhttps%3A%2F%2Fwww.cnnindonesia.com%2Fnasional&backURL=https%3A%2F%2Fwww.cnnindonesia.com%2Fnasional
https://www.cnnindonesia.com/
https://www.cnnindonesia.com/
https://www.cnnindonesia.com/nasional
https://www.cnnindonesia.com/nasional/politik
https://www.cnnindonesia.com/nasional/hukum-kriminal
https://www.cnnindonesia.com/nasional/peristiwa
https://www.cnnindonesia.com/pemilu2024
https://www.cnnindonesia.com/nasional/info-politik
https://www.cnnindonesia.com/nasional/20240320075141-20-1076456/makam-sunan-kalijaga-di-demak-kebanjiran-warga-tetap-datang-ziarah
https://www.cnnindonesia.com/nasional/20240319200953-617-1076339/hasil-akhir-penghitungan-suara-pilpres-2024-di-pulau-sulawesi
https://www.cnnindonesia.com/nasional/20240320064858-617-1076426/prabowo-gibran-sapu-kemenangan-pilpres-2024-di-34-provinsi
https://www.cnnindonesia.com/internasional
https://www.cnnindonesia.com/internasional/asean
https://www.cnnindonesia.com/internasional/asia-pasifik
https://www.cnnindonesia.com/internasional/timur-tengah
https://www.cnnindonesia.com/internasional/eropa-amerika
https://www.cnnindonesia.com/internasional/20240320072542-124-1076442/video-penampakan-banjir-bandang-yang-terjang-duhok-irak
https://www.cnnindonesia.com/internasional/20240319194728-113-1076331/kenapa-china-larang-warganya-ke-tempat-judi-di-singapura
https://www.cnnindonesia.com/internasional/20240320062733-120-1076412/qatar-ultimatum-israel-serang-rafah-sampai-rumor-penerus-kim-jong-un
https://www.cnnindonesia.com/ekonomi
https://www.cnnindonesia.com/ekonomi/keuangan
https://www.cnnindonesia.com/ekonomi/energi
https://www.cnnindonesia.com/ekonomi/bisnis
https://www.cnnindonesia.com/ekonomi/makro
https://www.cnnindonesia.com/ekonomi/corporate-action
https://www.cnnindonesia.com/ekonomi/20240320073500-92-1076451/erick-thohir-ganti-komisaris-pln-eks-bankir-nawal-nely-masuk
https://www.cnnindonesia.com/ekonomi/20240320071944-92-1076443/erick-thohir-pangkas-bumn-karya-dari-7-jadi-3-perusahaan
https://www.cnnindonesia.com/ekonomi/20240320064244-92-1076416/mengendus-gimik-di-balik-thr-ojol-hingga-kurir-paket
https://www.cnnindonesia.com/olahraga
https://www.cnnindonesia.com/olahraga/sepakbola
https://www.cnnindonesia.com/olahraga/moto-gp
https://www.cnnindonesia.com/olahraga/f1
https://www.cnnindonesia.com/olahraga/raket
https://www.cnnindonesia.com/olahraga/20240320072307-170-1076441/gregoria-dan-apri-fadia-jaga-mesin-tetap-panas-di-swiss-open-2024
https://www.cnnindonesia.com/olahraga/20240320074943-142-1076454/ronaldo-dicoret-dari-timnas-portugal-masih-liburan-bareng-keluarga
https://www.cnnindonesia.com/olahraga/20240320000816-178-1076389/megawati-pamer-pujian-legenda-badminton-greysia-polii
https://www.cnnindonesia.com/teknologi
https://www.cnnindonesia.com/teknologi/teknologi-informasi
https://www.cnnindonesia.com/teknologi/sains
https://www.cnnindonesia.com/teknologi/telekomunikasi
https://www.cnnindonesia.com/teknologi/climate
https://www.cnnindonesia.com/teknologi/20240318145257-199-1075716/bmkg-beber-prediksi-hilal-syawal-1445-h-idulfitri-berpotensi-serentak
https://www.cnnindonesia.com/teknologi/20240319162709-185-1076246/pengadilan-inggris-buktikan-klaim-palsu-pencipta-bitcoin
https://www.cnnindonesia.com/teknologi/20240319110351-201-1076037/foto-tsunami-sampah-di-kampung-nelayan-pandeglang
https://www.cnnindonesia.com/otomotif
https://www.cnnindonesia.com/otomotif/tren
https://www.cnnindonesia.com/otomotif/mobil
https://www.cnnindonesia.com/otomotif/motor
https://www.cnnindonesia.com/otomotif/e-vehicle
https://www.cnnindonesia.com/otomotif/commercial
https://www.cnnindonesia.com/otomotif/20240319195137-579-1076334/mitsubishi-indonesia-komentari-xpander-tabrak-porsche-rp9-miliar
https://www.cnnindonesia.com/otomotif/20240319181531-649-1076295/fuso-respons-banjir-truk-tambang-impor-di-indonesia
https://www.cnnindonesia.com/otomotif/20240319204315-579-1076361/viral-xpander-tabrak-kafe-di-surabaya-berujung-damai
https://www.cnnindonesia.com/hiburan
https://www.cnnindonesia.com/hiburan/film
https://www.cnnindonesia.com/hiburan/musik
https://www.cnnindonesia.com/hiburan/seleb
https://www.cnnindonesia.com/hiburan/seni-budaya
https://www.cnnindonesia.com/musicatnewsroom
https://www.cnnindonesia.com/hiburan/20240311065946-220-1072896/daftar-lengkap-pemenang-piala-oscar-2024
https://www.cnnindonesia.com/hiburan/20240320061515-234-1076428/anak-ungkap-kronologi-donny-kesuma-meninggal-dunia
https://www.cnnindonesia.com/hiburan/20240124161007-220-1053883/8-film-peraih-nominasi-best-picture-oscar-2024-tonton-di-mana
https://www.cnnindonesia.com/gaya-hidup
https://www.cnnindonesia.com/gaya-hidup/health
https://www.cnnindonesia.com/gaya-hidup/food
https://www.cnnindonesia.com/gaya-hidup/travel
https://www.cnnindonesia.com/gaya-hidup/trends
https://www.cnnindonesia.com/gaya-hidup/20240314190334-284-1074431/5-doa-meminta-kesembuhan-untuk-diri-sendiri-dan-orang-lain
https://www.cnnindonesia.com/gaya-hidup/20240320063808-284-1076414/angka-pernikahan-di-surabaya-terus-menurun-apa-sebabnya
https://www.cnnindonesia.com/gaya-hidup/20230922101631-525-1002301/ci-n-ta-rasa-william-wongso
https://www.cnnindonesia.com/tv
#
https://www.cnnindonesia.com/foto
https://www.cnnindonesia.com/video
https://www.cnnindonesia.com/infografis
https://www.cnnindonesia.com/indeks
https://www.cnnindonesia.com/fokus
https://www.cnnindonesia.com/kolom
https://www.cnnindonesia.com/terpopuler
https://www.cnnindonesia.com/pemilu2024
https://www.cnnindonesia.com/features
#
#
https://www.cnnindonesia.com/tv
https://www.cnnindonesia.com/nasional
https://www.cnnindonesia.com/nasional/politik
https://www.cnnindonesia.com/nasional/hukum-kriminal
https://www.cnnindonesia.com/nasional/peristiwa
https://www.cnnindonesia.com/pemilu2024
https://www.cnnindonesia.com/nasional/info-politik
https://www.cnnindonesia.com/nasional/20240320080902-32-1076467/sespri-iriana-klaim-sudah-dapat-restu-jokowi-maju-pilkada-kota-bogor
https://www.cnnindonesia.com/nasional/20240319203335-20-1076353/kakek-yang-meninggal-saat-kunker-jokowi-alami-gagal-jantung
https://www.cnnindonesia.com/nasional/20240319191903-32-1076322/istana-bantah-pertemuan-jokowi-dan-2-menteri-pkb-hambat-hak-angket
https://www.cnnindonesia.com/nasional/20240320064214-617-1076415/tenggat-waktu-habis-kpu-umumkan-pemenang-pilpres-2024-hari-ini
https://www.cnnindonesia.com/nasional/20240319194737-617-1076332/hasil-akhir-rekapitulasi-suara-pilpres-2024-di-pulau-sumatera
https://www.cnnindonesia.com/nasional/20240320070329-617-1076440/anies-tonton-hari-penetapan-pemenang-pilpres-2024-di-markas-amin
https://www.cnnindonesia.com/nasional/20240320040858-617-1076402/nama-beken-berpotensi-maju-dari-jabar-vii-presiden-pks-hingga-verrel
https://www.cnnindonesia.com/nasional/20240320050358-617-1076406/kpu-ungkap-kendala-rekapitulasi-di-papua-dan-papua-pegunungan
https://www.cnnindonesia.com/nasional/20240319225921-617-1076384/kpu-belum-putuskan-nasib-caleg-nasdem-ratu-wulla-yang-mundur
https://www.cnnindonesia.com/nasional/20240320075141-20-1076456/makam-sunan-kalijaga-di-demak-kebanjiran-warga-tetap-datang-ziarah
https://www.cnnindonesia.com/nasional/20240319200953-617-1076339/hasil-akhir-penghitungan-suara-pilpres-2024-di-pulau-sulawesi
https://www.cnnindonesia.com/tag/selusur-politik
https://www.cnnindonesia.com/nasional/20240215132725-617-1062994/jejak-prabowo-dijuluki-08-kini-menuju-presiden-indonesia-ke-8
https://www.cnnindonesia.com/nasional/20231130171744-617-1031217/secuil-perwakilan-perempuan-di-timses-para-capres
https://www.cnnindonesia.com/nasional/20231116204139-617-1025285/para-pemilih-galau-penentu-kemenangan-ganjar-anies-prabowo
https://www.cnnindonesia.com/nasional/20240320064858-617-1076426/prabowo-gibran-sapu-kemenangan-pilpres-2024-di-34-provinsi
https://www.cnnindonesia.com/nasional/20240320061901-12-1076410/jejak-terakhir-satu-keluarga-sebelum-tewas-bunuh-diri-di-apartemen-dki
https://www.cnnindonesia.com/nasional/20240320070329-617-1076440/anies-tonton-hari-penetapan-pemenang-pilpres-2024-di-markas-amin
https://www.cnnindonesia.com/nasional/20240320064214-617-1076415/tenggat-waktu-habis-kpu-umumkan-pemenang-pilpres-2024-hari-ini
https://www.cnnindonesia.com/tag/ensiklopemilu
https://www.cnnindonesia.com/nasional/20240228105707-617-1068166/syarat-kursi-dprd-jika-ridwan-kamil-hingga-sahroni-mau-jadi-cagub-dki
https://www.cnnindonesia.com/nasional/20240211215450-617-1061214/syarat-capres-menang-satu-putaran-di-pilpres-2024
https://www.cnnindonesia.com/nasional/20240128194241-617-1055453/sistem-noken-hanya-diterapkan-di-papua-pegunungan-papua-tengah
https://www.cnnindonesia.com/nasional/20240319194737-617-1076332/hasil-akhir-rekapitulasi-suara-pilpres-2024-di-pulau-sumatera
https://www.cnnindonesia.com/nasional/20240320050358-617-1076406/kpu-ungkap-kendala-rekapitulasi-di-papua-dan-papua-pegunungan
https://www.cnnindonesia.com/nasional/20240320040858-617-1076402/nama-beken-berpotensi-maju-dari-jabar-vii-presiden-pks-hingga-verrel
https://www.cnnindonesia.com/nasional/20240319225921-617-1076384/kpu-belum-putuskan-nasib-caleg-nasdem-ratu-wulla-yang-mundur
https://www.cnnindonesia.com/nasional/20240319201544-12-1076345/amy-wn-korsel-dicecar-16-pertanyaan-soal-dugaan-perzinahan-tisya-erni
https://www.cnnindonesia.com/nasional/20240307163914-20-1071722/profil-imam-sapiie-jawara-betawi-penggeser-nama-jalan-senen-raya
https://www.cnnindonesia.com/tag/analisis?kanal=nasional
https://www.cnnindonesia.com/nasional/20240319093944-32-1075985/hitung-hitung-posisi-jokowi-di-pemerintahan-prabowo-gibran
https://www.cnnindonesia.com/nasional/20240318092318-12-1075512/mandek-kasus-pemerasan-firli-bahuri-hati-hati-atau-saling-sandera
https://www.cnnindonesia.com/nasional/20240314074640-32-1074060/cantelan-partai-untuk-jokowi-golkar-terlalu-sulit-psi-terlalu-kecil
https://www.cnnindonesia.com/nasional/20240319203335-20-1076353/kakek-yang-meninggal-saat-kunker-jokowi-alami-gagal-jantung
https://www.cnnindonesia.com/nasional/20240319212056-20-1076370/satu-jenazah-abk-kapal-tenggelam-di-selayar-ditemukan-18-masih-hilang
https://www.cnnindonesia.com/nasional/20240320034138-12-1076401/6-terdakwa-ppln-kl-dituntut-6-bulan-penjara-masa-percobaan-1-tahun
https://www.cnnindonesia.com/nasional/20240319132500-12-1076129/kpk-panggil-2-hakim-agung-usut-kasus-gratifikasi-tppu-gazalba-saleh
https://www.cnnindonesia.com/nasional/20240319175924-20-1076303/polda-lampung-siapkan-buffer-zone-mudik-lebaran-2024-berikut-titiknya
https://www.cnnindonesia.com/tag/video/video-cnn?kanal=nasional
https://www.cnnindonesia.com/nasional/20240313145620-24-1073809/video-operasi-sar-puluhan-abk-kapal-ikan-yang-terbalik-di-selayar
https://www.cnnindonesia.com/nasional/20240311092622-24-1072923/video-banjir-dan-longsor-terjang-sumbar-19-orang-tewas-dan-7-hilang
https://www.cnnindonesia.com/nasional/20240307170710-24-1071746/video-banjir-cirebon-lumpuhkan-aktivitas-di-40-sekolah
https://www.cnnindonesia.com/nasional/20240318153653-20-1075748/jadwal-imsak-di-jabodetabek-hari-ini-rabu-20-maret-2024
https://www.cnnindonesia.com/nasional/20240304113652-20-1070124/jadwal-imsak-dan-subuh-hari-ini-rabu-20-maret-2024
https://www.cnnindonesia.com/nasional/20240319230754-32-1076385/anggota-komisi-i-dpr-sesalkan-komentar-ndiaye-soal-netralitas-jokowi
https://www.cnnindonesia.com/nasional/indeks/3
https://www.cnnindonesia.com/tag/suara-arus-bawah?kanal=nasional
https://www.cnnindonesia.com/nasional/20240112162855-617-1048782/spanduk-kampanye-semrawut-jadi-andalan-tapi-bikin-cemas-warga
https://www.cnnindonesia.com/nasional/20240123152858-617-1053323/empat-debat-pilpres-dan-gimik-para-paslon-di-mata-calon-pemilih
https://www.cnnindonesia.com/nasional/20231206132947-32-1033613/khawatir-warga-kembali-ke-zaman-orba-jika-gubernur-dipilih-presiden
#
#anchor
https://www.cnnindonesia.com/
//app.cnnindonesia.com
https://www.cnnindonesia.com/nasional
https://www.cnnindonesia.com/internasional
https://www.cnnindonesia.com/ekonomi
https://www.cnnindonesia.com/olahraga
https://www.cnnindonesia.com/teknologi
https://www.cnnindonesia.com/otomotif
https://www.cnnindonesia.com/hiburan
https://www.cnnindonesia.com/gaya-hidup
https://www.berbuatbaik.id/?utm_source=cnn&utm_medium=footer&utm_campaign=berbuatbaikid
https://www.cnnindonesia.com/tv
https://www.facebook.com/CNNindonesia
https://twitter.com/cnnindonesia
https://instagram.com/cnnindonesia
https://www.cnnindonesia.com/tentang-kami
https://www.cnnindonesia.com/tentang-kami#redaksi
https://www.cnnindonesia.com/pedoman-media-siber
https://www.cnnindonesia.com/karir
https://www.cnnindonesia.com/disclaimer
https://us.cnn.com/
https://www.cnn.com/
https://cnnespanol.cnn.com/
http://www.cnnchile.com
http://www.cnnmexico.com
https://arabic.cnn.com/
https://www.cnn.co.jp/
https://www.cnnturk.com/

5. Performance Optimization
*Scenario:* You are provided with a database schema and a query that is running slow. The query involves joining three tables and filtering on a non-indexed column. Propose optimizations to improve the query's performance without significantly altering its output.

 Let find username, product id, total amount, and rating for each product

explain analyze select u.users,
					   o.id_product,
					   sum(o.revenue) total_amount, 
					   r.reviews_rating rating 
from db_users_dim_kaggle u
left join db_orders_fact_kaggle o on u.users_id = o.users_id
left join db_reviews_dim_kaggle r on r.reviews_id = o.reviews_id
where u.users_id = 'C10248'
group by 1,2,4

1. Without indexing execution time = 2.76 ms

In [17]:
from IPython.display import Image  
Image(url="not-indexes-column.png", width=500, height=250)

2. Using indexing execution time = 0.25 ms (faster than without indexing)

CREATE INDEX idx_users_id_users ON db_users_dim_kaggle (users_id);
CREATE INDEX idx_users_id_orders ON db_orders_fact_kaggle (users_id);
CREATE INDEX idx_reviews_id_orders ON db_orders_fact_kaggle (reviews_id);
CREATE INDEX idx_reviews_id_reviews ON db_reviews_dim_kaggle (reviews_id);

In [18]:
from IPython.display import Image  
Image(url="indexes-column.png", width=500, height=250)

6. Data Pipeline Design
*Scenario:* Design a data pipeline for processing web server logs to identify suspicious activities. The pipeline should collect logs, filter for specific patterns indicating potential security threats, and alert the security team.

On-progress

7. Dashboard Design
*Scenario:* Design a dashboard on POWER BI. You can free to showcase me any design which you think is good and relevant for any type of scenario.

Link dashboard = https://app.powerbi.com/view?r=eyJrIjoiODRiNWNmY2MtZTczOS00ZjBmLWJjNjQtYjBlYmJmZjQyMmVlIiwidCI6IjhmMDg4Y2I0LWUyNGMtNDAzMy04NDEyLTRiNjIzNjhiNzNkOSIsImMiOjEwfQ%3D%3D